<h1>Numpy</h1>

https://learn.microsoft.com/en-us/training/modules/explore-analyze-data-with-python/3-exercise-explore-data?source=learn

<p>Mathematical tool and offers mathematical functions

- Lists are not optimized for numeric analysis. We use <b>NumPy arrays</b> : has specific data types and functions to work with Numbers in Python

<h4> Data Science Process</h4>
<p>
1. Clean data to handle errors, missing values, and other issues.
2. Apply statistical techniques to better understand the data, and how the sample might be expected to represent the real-world population of data, allowing for random variation
3. Visualize data to determine relationships between variables, and in the case of a machine learning project, identify features that are potentially predictive of the label.
Revise the hypothesis and repeat the process.
</p>

In [6]:
# !pip install numpy
import numpy as np

In [7]:
# excel for Python. Easily used with data tables
# Manipulate and analyses data
data = [50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64]


grades = np.array(data)
print(grades)

[50 50 47 97 49  3 53 42 26 74 82 62 37 15 70 27 36 35 48 52 63 64]

In [8]:
# difference between list and np.array.
#If multiple nparray multiples the values but list replicates the values

print(type(data),"The list multiplied becomes: ",data*2)
print('---'*8)
print(type(grades),"The numpy array multiplied becomes: ",grades*2)

#The nd indicates that this is a structure that can consists of multiple dimensions (it can have n dimensions).

<class 'list'> The list multiplied becomes:  [50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64, 50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64]
------------------------
<class 'numpy.ndarray'> The numpy array multiplied becomes:  [100 100  94 194  98   6 106  84  52 148 164 124  74  30 140  54  72  70
  96 104 126 128]

In [9]:
grades.shape #returns (22,)
grades.shape[0] #return 22
# the grades only has one dimension

22

In [10]:
#average
grades.mean()

49.18181818181818

In [11]:
study_hours = [10.0,11.5,9.0,16.0,9.25,1.0,11.5,9.0,8.5,14.5,15.5,
               13.75,9.0,8.0,15.5,8.0,9.0,6.0,10.0,12.0,12.5,12.0]
student_data = np.array([study_hours,grades])

student_data
# It becomes a 2D Because it is an array of arrays

array([[10.  , 11.5 ,  9.  , 16.  ,  9.25,  1.  , 11.5 ,  9.  ,  8.5 ,
        14.5 , 15.5 , 13.75,  9.  ,  8.  , 15.5 ,  8.  ,  9.  ,  6.  ,
        10.  , 12.  , 12.5 , 12.  ],
       [50.  , 50.  , 47.  , 97.  , 49.  ,  3.  , 53.  , 42.  , 26.  ,
        74.  , 82.  , 62.  , 37.  , 15.  , 70.  , 27.  , 36.  , 35.  ,
        48.  , 52.  , 63.  , 64.  ]])

In [12]:
student_data.shape
#2 rows: study hours and grades ; 22 columns

(2, 22)

In [13]:
avg_study = student_data[0].mean()
avg_grade = student_data[1].mean()

print('Average study hours : {:.2f} \n Average Grade is {:.2f}'.format(avg_study, avg_grade))

Average study hours : 10.52
 Average Grade is 49.18

<h1>Pandas</h1>
- More convenient structure to work with tabular data (2D data in a table) <b>Data Frame</b>
- Data frame has <i>Index </i> to identify each row

In [ ]:
!pip install pandas
import pandas as pd

In [16]:
df_students = pd.DataFrame({'Name': ['Dan', 'Joann', 'Pedro', 'Rosie', 'Ethan', 'Vicky', 'Frederic', 'Jimmie', 
                                     'Rhonda', 'Giovanni', 'Francesca', 'Rajab', 'Naiyana', 'Kian', 'Jenny',
                                     'Jakeem','Helena','Ismat','Anila','Skye','Daniel','Aisha'],
                            'StudyHours':student_data[0],
                            'Grade':student_data[1]})

df_students

         Name  StudyHours  Grade
0         Dan       10.00   50.0
1       Joann       11.50   50.0
2       Pedro        9.00   47.0
3       Rosie       16.00   97.0
4       Ethan        9.25   49.0
5       Vicky        1.00    3.0
6    Frederic       11.50   53.0
7      Jimmie        9.00   42.0
8      Rhonda        8.50   26.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
12    Naiyana        9.00   37.0
13       Kian        8.00   15.0
14      Jenny       15.50   70.0
15     Jakeem        8.00   27.0
16     Helena        9.00   36.0
17      Ismat        6.00   35.0
18      Anila       10.00   48.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0

<b> Loc </b> is used to find and filter values for a specific index value or row

In [22]:
df_students.loc[5]
'''
Returns
Name          Vicky
StudyHours      1.0
Grade           3.0
'''
# Returns a range of values from 0 to 5
df_students.loc[0:5]

    Name  StudyHours  Grade
0    Dan       10.00   50.0
1  Joann       11.50   50.0
2  Pedro        9.00   47.0
3  Rosie       16.00   97.0
4  Ethan        9.25   49.0
5  Vicky        1.00    3.0

<b>Iloc</b> is used to find rows based on their position in the DataFrame eg. the first 5 rows in data frame

In [23]:
df_students.iloc[0:5]

    Name  StudyHours  Grade
0    Dan       10.00   50.0
1  Joann       11.50   50.0
2  Pedro        9.00   47.0
3  Rosie       16.00   97.0
4  Ethan        9.25   49.0

In [24]:
# Find the first two values in row 0 of student data that is studyHours 
df_students.iloc[0,[1,2]]

StudyHours    10.0
Grade         50.0
Name: 0, dtype: object

In [ ]:
The Loc Method can be used with Filtering

In [25]:
# Row 0 Column Grade
df_students.loc[0,'Grade']

50.0

In [29]:
df_students.loc[df_students['Name']=='Aisha']
# OR 
df_students[df_students['Name']=='Aisha']
# OR 
df_students.query('Name == "Aisha"')
# OR
df_students[df_students.Name == 'Aisha']

     Name  StudyHours  Grade
21  Aisha        12.0   64.0